// components/workProg/index.js
Component({
   /**
    * 组件的属性列表
    */
   properties: {

   },

   /**
    * 组件的初始数据
    */
   data: {
      workData: [{
            name: "神州数码(深圳)有限公司",
            date: "2018.10 - 2020.09",
            desc: [ //工作描述
               {
                  id: 1,
                  content: "参与项目需求分析，技术选型，框架搭建，前期公共组件开发，保证系统如期完成;",
               }, {
                  id: 2,
                  content: "参与制定前端开发规范，项目组件开发、维护，项目后期维护、代码复查;",
               }, {
                  id: 3,
                  content: "根据设计图、原型，编写高质量html和css还原页面、效果，与后台人员对接、联调;",
               }
            ]
         }, {
            name: "深圳市博安达科技股份有限公司",
            date: "2017.05 - 2018.09",
            desc: []
         }, {
            name: "深圳市华炎科技有限公司",
            date: "2015.08 - 2017.04",
            desc: []
         }


      ]
   },

   /**
    * 组件的方法列表
    */
   methods: {

   }
})